INSERT INTO Genres (genre_name) VALUES ('Экшн'),('Комедия'),('Драма'), ('Фэнтези'),('Ужасы'),('Мистика'), ('Мелодрама'),('Триллер'),('Вестерн');

INSERT INTO Authors (author_name) VALUES
    ('Лев Толстой'),('Александр Пушкин'),('Фёдор Достоевский'),
    ('Николай Гоголь'),('Александр Солженицын'),('Иван Тургенев'),
    ('Владимир Набоков'),('Антон Чехов'),('Михаил Булгаков'),
    ('Михаил Лермонтов'),('Максим Горький'),('Борис Пастернак'),
    ('Анна Ахматова'),('Иван Бунин');   

INSERT INTO Books (title, author_id, genre_id) VALUES
    ('Война и мир', 1, 3),  -- Лев Толстой, Драма
    ('Евгений Онегин', 2, 2),  -- Александр Пушкин, Комедия
    ('Преступление и наказание', 3, 6),  -- Фёдор Достоевский, Мистика
    ('Мертвые души', 4, 2),  -- Николай Гоголь, Комедия
    ('Архипелаг ГУЛАГ', 5, 6),  -- Александр Солженицын, Мистика
    ('Отцы и дети', 6, 3),  -- Иван Тургенев, Драма
    ('Лолита', 7, 8),  -- Владимир Набоков, Триллер
    ('Чайка', 8, 2),  -- Антон Чехов, Комедия
    ('Мастер и Маргарита', 9, 4),  -- Михаил Булгаков, Фэнтези
    ('Герой нашего времени', 10, 3),  -- Михаил Лермонтов, Драма
    ('Мать', 11, 3),  -- Максим Горький, Драма
    ('Доктор Живаго', 12, 3),  -- Борис Пастернак, Драма
    ('Реквием', 13, 5),  -- Анна Ахматова, Ужасы
    ('Деревня', 14, 2);  -- Иван Бунин, Комедия;
   
INSERT INTO Addresses (city_name, street_name) VALUES
    ('Пермь', 'улица Ленина 20'),
    ('Пермь', 'улица Куйбышева 10'),
    ('Пермь', 'улица Свердлова 11'),
    ('Пермь', 'бульвар Гагарина 12'),
    ('Пермь', 'улица Мира 15'),
    ('Пермь', 'проспект Комсомольский 12'),
    ('Пермь', 'улица Пушкина 50'),
    ('Пермь', 'улица Советская 25'),
    ('Пермь', 'улица Октябрьская 40'),
    ('Пермь', 'улица Кирова 3');
   
INSERT INTO Users (address_id, first_name, last_name) VALUES
    (1, 'Иван', 'Петров'),
    (1, 'Мария', 'Смирнова'),
    (2, 'Алексей', 'Кузнецов'),
    (3, 'Елена', 'Иванова'),
    (4, 'Андрей', 'Сергеев'),
    (5, 'Ольга', 'Лебедева'),
    (6, 'Николай', 'Романов'),
    (7, 'Татьяна', 'Павлова'),
    (8, 'Владимир', 'Михайлов'),
    (9, 'Светлана', 'Ковалева'),
    (10, 'Дмитрий', 'Федоров');
   
INSERT INTO Distribution (user_id, book_id, load_date, return_date, expected_return_date) VALUES
	--просроченные записи
    (1, 1, '2022-01-01 00:00:00', '2022-01-30 00:00:00', '2022-01-15 00:00:00'),
    (2, 2, '2022-01-10 00:00:00', '2022-02-01 00:00:00', '2022-01-24 00:00:00'),
    (3, 3, '2022-01-20 00:00:00', '2022-02-10 00:00:00', '2022-02-03 00:00:00'),
    (4, 4, '2022-01-25 00:00:00', '2022-02-15 00:00:00', '2022-02-08 00:00:00'),
    (5, 5, '2022-02-01 00:00:00', '2022-02-20 00:00:00', '2022-02-15 00:00:00'),
   	-- несколько книг
    (1, 1, '2022-01-01 00:00:00', NULL, '2022-01-15 00:00:00'),
    (1, 2, '2022-01-05 00:00:00', '2022-01-19 00:00:00', '2022-01-19 00:00:00'),
    (1, 3, '2022-01-10 00:00:00', NULL, '2022-01-24 00:00:00'),
    (2, 4, '2022-01-15 00:00:00', '2022-01-29 00:00:00', '2022-01-29 00:00:00'),
    (2, 5, '2022-01-20 00:00:00', NULL, '2022-02-03 00:00:00'),
    (3, 6, '2022-01-25 00:00:00', '2022-02-08 00:00:00', '2022-02-08 00:00:00'),
    (3, 7, '2022-02-01 00:00:00', NULL, '2022-02-15 00:00:00'),
    -- Нормальные записи
    (1, 4, '2022-01-01 00:00:00', '2022-01-15 00:00:00', '2022-01-15 00:00:00'),
    (1, 5, '2022-01-10 00:00:00', '2022-01-24 00:00:00', '2022-01-24 00:00:00'),
    (2, 6, '2022-01-15 00:00:00', '2022-01-29 00:00:00', '2022-01-29 00:00:00'),
    (2, 7, '2022-01-20 00:00:00', '2022-02-03 00:00:00', '2022-02-03 00:00:00'),
    (3, 8, '2022-01-25 00:00:00', '2022-02-08 00:00:00', '2022-02-08 00:00:00'),
    (3, 9, '2022-02-01 00:00:00', '2022-02-13 00:00:00', '2022-02-13 00:00:00'),
    (4, 10, '2022-02-05 00:00:00', '2022-02-17 00:00:00', '2022-02-17 00:00:00'),
    (4, 11, '2022-02-10 00:00:00', '2022-02-23 00:00:00', '2022-02-23 00:00:00'),
    (5, 12, '2022-02-15 00:00:00', '2022-02-28 00:00:00', '2022-02-28 00:00:00'),
    (5, 13, '2022-02-20 00:00:00', '2022-03-01 00:00:00', '2022-03-01 00:00:00');
    
